In [100]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
d=pd.read_csv("C:/Users/ragin/Downloads/Exchange_Rates.csv")

In [3]:
d1=pd.read_csv("C:/Users/ragin/Downloads/Sales.csv")

In [4]:
d2=pd.read_csv("C:/Users/ragin/Downloads/Products.csv")

In [5]:
d3=pd.read_csv("C:/Users/ragin/Downloads/Stores.csv")

In [6]:
d4 = pd.read_csv("C:/Users/ragin/Downloads/Customers.csv", encoding='latin1')

### d4 -- CUSTOMERS DETAILS

In [8]:
d4.head()

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979
2,554,Female,Claire Ferres,WINJALLOK,VIC,Victoria,3380,Australia,Australia,5/26/1947
3,786,Male,Jai Poltpalingada,MIDDLE RIVER,SA,South Australia,5223,Australia,Australia,9/17/1957
4,1042,Male,Aidan Pankhurst,TAWONGA SOUTH,VIC,Victoria,3698,Australia,Australia,11/19/1965

### DESCRIBE ONLY NUMERICAL VALUE

In [10]:
d4.describe()

        CustomerKey
count  1.526600e+04
mean   1.060508e+06
std    6.127097e+05
min    3.010000e+02
25%    5.140335e+05
50%    1.079244e+06
75%    1.593980e+06
max    2.099937e+06

In [11]:
### DESCRIBE CATEGORICAL DATA
d4.describe(include='object')

,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
count,15266,15266,15266,15256,15266,15266,15266,15266,15266
unique,2,15118,8258,467,512,9505,8,3,11270
top,Male,John Smith,Toronto,CA,California,90017,United States,North America,6/12/1989
freq,7748,4,204,740,715,70,6828,8381,5

In [12]:
d4.shape

(15266, 10)

In [13]:
d4.isnull().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

### FILL THE NAN VALUES (10 DATA ONLY)

In [15]:
d4['State Code'] = d4['State Code'].fillna(d4['State Code'].mode()[0])

In [16]:
d4['State Code'].isnull().sum()

0

In [17]:
d4['State Code']

0         SA
1         WA
2        VIC
3         SA
4        VIC
        ...
15261     TX
15262     VA
15263     NC
15264     CA
15265     MI
Name: State Code, Length: 15266, dtype: object

In [18]:
d4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15266 entries, 0 to 15265
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   CustomerKey  15266 non-null  int64
 1   Gender       15266 non-null  object
 2   Name         15266 non-null  object
 3   City         15266 non-null  object
 4   State Code   15266 non-null  object
 5   State        15266 non-null  object
 6   Zip Code     15266 non-null  object
 7   Country      15266 non-null  object
 8   Continent    15266 non-null  object
 9   Birthday     15266 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.2+ MB

In [19]:
d4.dtypes

CustomerKey     int64
Gender         object
Name           object
City           object
State Code     object
State          object
Zip Code       object
Country        object
Continent      object
Birthday       object
dtype: object

In [20]:
d4.duplicated().sum()

0

### D3 -- STORES DETAILS

In [23]:
d3.head()

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008
2         3  Australia               South Australia         2000.0   1/7/2012
3         4  Australia                      Tasmania         2000.0   1/1/2010
4         5  Australia                      Victoria         2000.0  12/9/2015

In [24]:
d3.describe()

        StoreKey  Square Meters
count  67.000000      66.000000
mean   33.000000    1402.196970
std    19.485037     576.404058
min     0.000000     245.000000
25%    16.500000    1108.750000
50%    33.000000    1347.500000
75%    49.500000    2000.000000
max    66.000000    2105.000000

In [58]:
d3['Square Meters'].fillna(0, inplace=True)

C:\Users\ragin\AppData\Local\Temp\ipykernel_22348\1187139352.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  d3['Square Meters'].fillna(0, inplace=True)

In [60]:
d3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   StoreKey       67 non-null     int64
 1   Country        67 non-null     object
 2   State          67 non-null     object
 3   Square Meters  67 non-null     float64
 4   Open Date      67 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 2.7+ KB

In [26]:
d3.shape

(67, 5)

In [27]:
d3.describe(include='object')

              Country                         State Open Date
count              67                            67        67
unique              9                            67        25
top     United States  Australian Capital Territory  1/1/2010
freq               24                             1         9

### D -- EXCHANGE RATES DETAILS

In [30]:
d.head()

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583
2  1/1/2015      AUD    1.2214
3  1/1/2015      EUR    0.8237
4  1/1/2015      GBP    0.6415

In [31]:
d.shape

(11215, 3)

In [32]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  object
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: float64(1), object(2)
memory usage: 263.0+ KB

### D1 -- SALES DETAILS

In [35]:
d1.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD

In [36]:
d1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  object
 3   Delivery Date  13165 non-null  object
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: int64(6), object(3)
memory usage: 4.3+ MB

In [37]:
d1.shape

(62884, 9)

In [38]:
d1.isnull().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

### DROP DELIVERY DATE

In [40]:
d1.dropna(subset=['Delivery Date'], inplace=True)

In [41]:
d1.isnull().sum()

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [42]:
d1.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD
2,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD
3,366002,1,1/1/2016,1/12/2016,266019,0,1106,7,CAD
4,366002,2,1/1/2016,1/12/2016,266019,0,373,1,CAD
5,366002,3,1/1/2016,1/12/2016,266019,0,1080,4,CAD

In [43]:
d1.isnull().sum()

Order Number     0
Line Item        0
Order Date       0
Delivery Date    0
CustomerKey      0
StoreKey         0
ProductKey       0
Quantity         0
Currency Code    0
dtype: int64

In [44]:
d1.dtypes

Order Number      int64
Line Item         int64
Order Date       object
Delivery Date    object
CustomerKey       int64
StoreKey          int64
ProductKey        int64
Quantity          int64
Currency Code    object
dtype: object

### D2 -- PRODUCTS DETAILS

In [47]:
d2.head()

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio
2,3,Contoso 1G MP3 Player E100 White,Contoso,White,$7.40,$14.52,101,MP4&MP3,1,Audio
3,4,Contoso 2G MP3 Player E200 Silver,Contoso,Silver,$11.00,$21.57,101,MP4&MP3,1,Audio
4,5,Contoso 2G MP3 Player E200 Red,Contoso,Red,$11.00,$21.57,101,MP4&MP3,1,Audio

In [48]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   object
 5   Unit Price USD  2517 non-null   object
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: int64(3), object(7)
memory usage: 196.8+ KB

In [49]:
d2['Unit Cost USD'] = d2['Unit Cost USD'].str.replace('$', '').str.replace(',', '').str.strip()
d2['Unit Price USD'] = d2['Unit Price USD'].str.replace('$', '').str.replace(',', '').str.strip()



d2['Unit Cost USD'] = d2['Unit Cost USD'].astype(float)
d2['Unit Price USD'] = d2['Unit Price USD'].astype(float)

In [50]:
d2.shape

(2517, 10)

In [51]:
d2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2517 entries, 0 to 2516
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   ProductKey      2517 non-null   int64
 1   Product Name    2517 non-null   object
 2   Brand           2517 non-null   object
 3   Color           2517 non-null   object
 4   Unit Cost USD   2517 non-null   float64
 5   Unit Price USD  2517 non-null   float64
 6   SubcategoryKey  2517 non-null   int64
 7   Subcategory     2517 non-null   object
 8   CategoryKey     2517 non-null   int64
 9   Category        2517 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 196.8+ KB

In [52]:
d2.isnull().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [90]:
merged_data = pd.merge(d1, d4, on='CustomerKey', how='inner') # d1=sales,d4=customers
print("After merging df and df2:", merged_data.shape)

# Merge with d2
if not merged_data.empty:
    merged_data = pd.merge(merged_data, d2, on='ProductKey', how='inner') # d2=product
    print("After merging with df1:", merged_data.shape)

# Merge with d3
if not merged_data.empty:
    merged_data = pd.merge(merged_data, d3, on='StoreKey', how='inner') # d3=store
    print("After merging with df3:", merged_data.shape)

# Merge with d
if not merged_data.empty:
    merged_data = pd.merge(merged_data, d, left_on='Order Date', right_on='Date', how='inner')
    print("After merging with df4:", merged_data.shape)

After merging df and df2: (13165, 18)
After merging with df1: (13165, 27)
After merging with df3: (13165, 31)
After merging with df4: (65825, 34)

In [102]:
merged_data.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,...,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Square Meters,Open Date,Currency,Exchange
0,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,USD,1.0000
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,CAD,1.3884
2,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,AUD,1.3683
3,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,EUR,0.9185
4,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,GBP,0.6742

In [94]:
merged_data.drop(columns=['State_y', 'Country_y', 'Date'], inplace=True)

In [96]:
merged_data.rename(columns={'State_x': 'State', 'Country_x': 'Country'}, inplace=True)

In [106]:
merged_data.columns

Index(['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code',
       'Gender', 'Name', 'City', 'State Code', 'State', 'Zip Code', 'Country',
       'Continent', 'Birthday', 'Product Name', 'Brand', 'Color',
       'Unit Cost USD', 'Unit Price USD', 'SubcategoryKey', 'Subcategory',
       'CategoryKey', 'Category', 'Square Meters', 'Open Date', 'Currency',
       'Exchange'],
      dtype='object')

In [108]:
data = merged_data.to_csv("dataspark.csv" , index = False)

In [112]:
data = pd.read_csv("C:/Users/ragin/Downloads/Project-2/dataspark.csv")

In [114]:
data.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,...,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Square Meters,Open Date,Currency,Exchange
0,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,USD,1.0000
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,CAD,1.3884
2,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,AUD,1.3683
3,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,EUR,0.9185
4,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,GBP,0.6742

In [116]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65825 entries, 0 to 65824
Data columns (total 31 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order Number    65825 non-null  int64
 1   Line Item       65825 non-null  int64
 2   Order Date      65825 non-null  object
 3   Delivery Date   65825 non-null  object
 4   CustomerKey     65825 non-null  int64
 5   StoreKey        65825 non-null  int64
 6   ProductKey      65825 non-null  int64
 7   Quantity        65825 non-null  int64
 8   Currency Code   65825 non-null  object
 9   Gender          65825 non-null  object
 10  Name            65825 non-null  object
 11  City            65825 non-null  object
 12  State Code      65825 non-null  object
 13  State           65825 non-null  object
 14  Zip Code        65825 non-null  object
 15  Country         65825 non-null  object
 16  Continent       65825 non-null  object
 17  Birthday        65825 non-null  object
 18  Product Name    65825 non-null  object
 19  Brand           65825 non-null  object
 20  Color           65825 non-null  object
 21  Unit Cost USD   65825 non-null  float64
 22  Unit Price USD  65825 non-null  float64
 23  SubcategoryKey  65825 non-null  int64
 24  Subcategory     65825 non-null  object
 25  CategoryKey     65825 non-null  int64
 26  Category        65825 non-null  object
 27  Square Meters   65825 non-null  float64
 28  Open Date       65825 non-null  object
 29  Currency        65825 non-null  object
 30  Exchange        65825 non-null  float64
dtypes: float64(4), int64(8), object(19)
memory usage: 15.6+ MB

In [128]:
data.shape

(65825, 31)

In [130]:
data.isnull().sum()

Order Number      0
Line Item         0
Order Date        0
Delivery Date     0
CustomerKey       0
StoreKey          0
ProductKey        0
Quantity          0
Currency Code     0
Gender            0
Name              0
City              0
State Code        0
State             0
Zip Code          0
Country           0
Continent         0
Birthday          0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
Square Meters     0
Open Date         0
Currency          0
Exchange          0
dtype: int64

In [118]:
data.duplicated().sum()

0

In [120]:
data.columns

Index(['Order Number', 'Line Item', 'Order Date', 'Delivery Date',
       'CustomerKey', 'StoreKey', 'ProductKey', 'Quantity', 'Currency Code',
       'Gender', 'Name', 'City', 'State Code', 'State', 'Zip Code', 'Country',
       'Continent', 'Birthday', 'Product Name', 'Brand', 'Color',
       'Unit Cost USD', 'Unit Price USD', 'SubcategoryKey', 'Subcategory',
       'CategoryKey', 'Category', 'Square Meters', 'Open Date', 'Currency',
       'Exchange'],
      dtype='object')

### CREATE DATABASE

In [122]:
import pymysql

myconnection = pymysql.connect(host = '127.0.0.1',user='root',passwd='Ragini95@')

cursor =myconnection.cursor()

cursor.execute("create database Data_Spark")

print("Database created successfully")

Database created successfully

In [126]:
#python mysql connection

myconnection = pymysql.connect(host='127.0.0.1', user='root',passwd='Ragini95@',database="Data_Spark")
read = pd.read_csv("dataspark.csv")
read = read.dropna() #drop null values
a = ",".join(f"`{i}` {j}" for i, j in zip(read.columns, read.dtypes)).replace("float64", "FLOAT").replace("object", "TEXT").replace("int64", "INT")
#replace dtypes from pandas to mysql
table_name = "production_sales_details"
myconnection.cursor().execute(f"create table {table_name} ({a})")
for i in range(len(read)):
    myconnection.cursor().execute(f"insert into {table_name} values {tuple(read.iloc[i])}")
    myconnection.commit()

print("data inserted successfully")

data inserted successfully

In [1]:
import pandas as pd
read = pd.read_csv("dataspark.csv")
read.head(10)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,...,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category,Square Meters,Open Date,Currency,Exchange
0,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,USD,1.0000
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,CAD,1.3884
2,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,AUD,1.3683
3,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,EUR,0.9185
4,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD,Male,...,141.47,427.00,402,Digital SLR Cameras,4,Cameras and camcorders,0.0,1/1/2010,GBP,0.6742
5,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,0.0,1/1/2010,USD,1.0000
6,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,0.0,1/1/2010,CAD,1.3884
7,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,0.0,1/1/2010,AUD,1.3683
8,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,0.0,1/1/2010,EUR,0.9185
9,366001,2,1/1/2016,1/13/2016,1269051,0,2007,1,USD,Male,...,220.64,665.94,803,Microwaves,8,Home Appliances,0.0,1/1/2010,GBP,0.6742